{
    "projects":  [
        {
            "id": 0,
            "title": "Coffee Shop Rating",
            "description": [
                "The project is a web application that allows users to share their experiences and opinions about coffee shops. Built using Node.js, JavaScript, HTML, CSS and AWS, the application is designed to show users who do not have experience in software development get a feel of what APIs are.",
                "The application uses the Express library to handle user requests and the AWS SDK to interact with various services in the AWS cloud. Users are required to provide their IAM credentials and the region they want to use in order to initialize the AWS services. These services include a Lambda function, an SQS queue, a DynamoDB table and an S3 bucket. The application also uses the IAM SDK to create a role for the Lambda function.",
                "Once the services are created, users can add coffee shops by filling a form which includes the name of the coffee shop, a rating, an image and a comment. This information is sent to the server which pushes it to the SQS queue, triggering the Lambda function which adds the information to the DynamoDB table.",
                "The users can view all the coffee shops they added in the home page of the app. The application is designed to be easily scalable, allowing for an increase in the number of users and their interactions with the application. The application is also optimized for security, performance and maintainability. The application can be easily containerized and deployed on different environments."
            ],
            "images": [
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/coffeeshopapp/coffeeshop3.png",
                    "details": "coffeeshop3"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/coffeeshopapp/coffeeshop2.png",
                    "details": "coffeeshop2"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/coffeeshopapp/coffeeshop1.png",
                    "details": "coffeeshop1"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/coffeeshopapp/coffeeshop4.png",
                    "details": "coffeeshop4"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/coffeeshopapp/coffeeshop5.png",
                    "details": "coffeeshop5"
                },                
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/coffeeshopapp/coffeeshop7.png",
                    "details": "coffeeshop7"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/coffeeshopapp/coffeeshop6.png",
                    "details": "coffeeshop6"
                }
            ],
            "tools": [
                {
                    "name": "JavaScript",
                    "icon": "javascriptIcon"
                },
                {
                    "name": "AWS",
                    "icon": "awsIcon"
                },
                {
                    "name": "NodeJS",
                    "icon": "nodejsIcon"
                }
            ],
            "showcase": true,
            "video": "https://www.youtube.com/embed/q09mrXWnbGI",
            "source": "https://github.com/josuesossou/API_For_Coffee_Shops"
        },
        {
            "id": 1,
            "title": "Countdown Timer",
            "description": [
                "The project is a web application that allows users to create and publish custom timers. Built using React, Redux and Firebase, the application is designed to be user-friendly and interactive, providing users with a wide range of customization options.",
                "The application allows users to create a timer using an interactive timer builder. Users can select how long they want the timer to run and choose a background color, gradient or image as the background of the timer. They can also change the color and font of the timer. Once the user has built their timer, they can publish it in the app, which allows each user to have a unique page where they can view the timer they built.",
                "This application is intended for people who want to keep track of important events in their lives, such as countdown to a vacation, a wedding, or any other special occasion. The application also allows users to share their timers with others, making it easy for them to plan and organize events together. The application is designed to be easily scalable, allowing for an increase in the number of users and their interactions with the application. The application is also optimized for security, performance and maintainability. The application can be easily deployed on different environments, and can be easily integrated with other third party services."
            ],
            "images": [
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/cdTimeImages/cdt1.png",
                    "details": "cdt1"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/cdTimeImages/cdt2.png",
                    "details": "cdt2"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/cdTimeImages/cdt3.png",
                    "details": "cdt3"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/cdTimeImages/cdt4.png",
                    "details": "cdt4"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/cdTimeImages/cdt5.png",
                    "details": "cdt5"
                }
            ],
            "tools": [
                {
                    "name": "React",
                    "icon": "reactIcon"
                },
                {
                    "name": "Firebase",
                    "icon": "firebaseIcon"
                }
            ],
            "showcase": true,
            "video": "https://www.youtube.com/embed/xSuTAQHiUn0",
            "source": "https://github.com/josuesossou/realcoundowntimer",
            "live": "https://realcoundowntimer-josuesossou.vercel.app/"
        },
        {
            "id": 2,
            "title": "Praise Teams App",
            "description": [
                "The project is a mobile application built using Flutter, a popular open-source framework for building high-performance and visually attractive mobile apps. The app utilizes the power of AWS Amplify, a set of tools and services that enables developers to build cloud-powered applications with ease.",
                "The app allows users to create worship events, where they can search for songs on YouTube and add them to their event. The app uses the YouTube API to search for songs, allowing users to easily find and add the songs they want to play. The app also allows users to add the key they want to play the song in and a link to the music sheet of the song, making it easy for users to prepare for the event.",
                "The app also includes a feature for users to create accounts, allowing them to save their events and easily access them in the future. The app's user-friendly interface and powerful backend make it an ideal solution for church communities and other worship groups to plan and organize their events."
            ],
            "images": [
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/pwteams/pw1.png",
                    "details": "pw1"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/pwteams/pw2.png",
                    "details": "pw2"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/pwteams/pw3.png",
                    "details": "pw3"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/pwteams/pw4.png",
                    "details": "pw4"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/pwteams/pw6.png",
                    "details": "pw6"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/pwteams/pw7.png",
                    "details": "pw7"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/pwteams/pw8.png",
                    "details": "pw8"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/pwteams/pw9.png",
                    "details": "pw9"
                }
            ],
            "tools": [
                {
                    "name": "Flutter",
                    "icon": "flutterIcon"
                },
                {
                    "name": "AWS Amplify",
                    "icon": "amplifyIcon"
                }
            ],
            "showcase": true,
            "source": "https://github.com/josuesossou/praise_team_app"
        },
        {
            "id": 3,
            "title": "Portfolio Website",
            "description": [
                "This project is my professional portfolio website, which showcases my proudest work and accomplishments. You are currently exploring its contents."
            ],
            "images": [
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/portfolio/portfolio1.png",
                    "details": "portfolio1"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/portfolio/portfolio2.png",
                    "details": "portfolio2"
                },
                {
                    "img": "https://josueportfolioimages.s3.amazonaws.com/portfolio/portfolio3.png",
                    "details": "portfolio3"
                }
            ],
            "tools": [
                {
                    "name": "Typescript",
                    "icon": "typescriptIcon"
                },
                {
                    "name": "NextJS",
                    "icon": "nextjsIcon"
                },
                {
                    "name": "Sass",
                    "icon": "sassIcon"
                }
            ],
            "showcase": true,
            "source": "https://github.com/josuesossou/mysite"
        }
    ],
    "skills": [
        {
            "name": "Java Script",
            "icon": "javascriptIcon"
        },
        {
            "name": "Typescript",
            "icon": "typescriptIcon"
        },
        {
            "name": "React",
            "icon": "reactIcon"
        },
        {
            "name": "Flutter",
            "icon": "flutterIcon"
        },
        {
            "name": "NodeJS",
            "icon": "nodejsIcon"
        },
        {
            "name": "AWS",
            "icon": "awsIcon"
        },
        {
            "name": "MongoDB",
            "icon": "mongoIcon"
        },
        {
            "name": "Firebase",
            "icon": "firebaseIcon"
        }
    ],
    "about": "I am a forward-thinking passionate software engineer with a bachelor's degree in Computer Science and 5 years of productive experience in dynamic environments. I have a strong working experience with JavaScript, NodeJS, React, AWS SDK, APIs, MongoDB, and MySQL. I am a proud team player with problem-solving skills, knowledgeable in data structures and algorithms, and focused on achieving project objectives with speed and accuracy."
}